mburger89/SMK/ports/stm32wb/platform/ble_hid_wb.c
// BLE HID glue for NUCLEO-WB55RG — same SMK BLE contract as
// ports/nrf52840/platform/ble_hid_sdc.c and
// ports/rp2040/platform/ble_hid_kbd_uart.c (init_ble_hid() /
// send_keyboard_report()), but the controller here is CPU2: a Cortex-M0+
// on the same die running ST's own prebuilt wireless-coprocessor firmware,
// reached over the IPCC mailbox rather than a UART or an in-image library.
//
// *** STATUS: build-only, no hardware verification. Every step below is a
// deliberate translation of a documented contract in the Task-6-vendored
// transport layer (platform/tl.h, shci_tl.h, shci.h, tl_mbox.c) and of
// BTstack's own STM32WB55 reference port, but nothing here has been
// exercised on real silicon. ***
//
// ---------------------------------------------------------------------------
// Why this file does NOT go through the vendored hci_tl.c
// ---------------------------------------------------------------------------
// Task 6 vendored ST's whole `interface/patterns/ble_thread/tl` directory,
// including hci_tl.c/hci_tl_if.c. Those two are deliberately NOT part of
// this target's source list any more (see ports/stm32wb/CMakeLists.txt's
// stm32wb_ipcc_srcs comment), for two independent reasons found by reading
// the real vendored code:
//
//   1. Symbol collision. hci_tl.h:185 declares
//        void hci_init(void(* UserEvtRx)(void* pData), void* pConf);
//      and hci_tl.c:68 defines it. BTstack's src/hci.c defines a function
//      with the same C-linkage name and a completely different signature
//      (`void hci_init(const hci_transport_t *, const void *)`). Both
//      objects are unconditionally part of the link, so keeping hci_tl.c
//      is a hard multiple-definition link error, not a stylistic choice.
//
//   2. It would swallow half the HCI event stream. hci_tl.c's
//      TlEvtReceived() (hci_tl.c:275-289) routes Command Complete
//      (TL_BLEEVT_CC_OPCODE) and Command Status (TL_BLEEVT_CS_OPCODE)
//      events into a *separate* queue (HciCmdEventQueue) that is drained
//      only by hci_send_req() — ST's own blocking ACI/HCI request API,
//      which BTstack never calls. Only "asynchronous" events reach
//      hci_user_evt_proc(). BTstack is the HCI *host* here and needs every
//      event, Command Complete/Status very much included (its init state
//      machine is driven by them), so that split is exactly wrong for this
//      integration.
//
// This is also precisely what BTstack's own reference port for this chip
// does: ~/btstack/port/stm32-wb55xx-nucleo-freertos/Makefile:91-96 builds
// shci_tl.c, shci_tl_if.c, tl_mbox.c, shci.c and stm_list.c — and no
// hci_tl.c. Its port/btstack_port.c talks to TL_BLE_Init()/TL_BLE_SendCmd()/
// TL_BLE_SendAclData() (tl.h:291-293) directly. This file follows that
// same design, adapted from FreeRTOS to this project's cooperative
// single-loop, no-RTOS style.
//
// Consequence for Task 6's two deliberately-unstubbed symbols: only
// shci_notify_asynch_evt() is still referenced (shci_tl.c:127, 142 and 230
// — the `void (*)(void*)` signature is read straight off shci_tl.h:108 and
// off those three real call sites, all of which pass
// `(void*) &SHciAsynchEventQueue`). hci_notify_asynch_evt() was referenced
// only from hci_tl.c (lines 131, 146, 285) and has no caller left in the
// link, so it is intentionally not defined here rather than added as dead
// code.

#include <stdint.h>
#include <string.h>

// --- BTstack ---------------------------------------------------------------
// Included before the ST headers on purpose: stm32_wpan_common.h #undefs and
// redefines a batch of very generic macro names (MIN/MAX/ALIGN/TRUE/FALSE/
// PAUSE/...), and BTstack's headers should be parsed with the compiler's own
// notion of those, not ST's.
#include "btstack.h"                 // pulls in hci.h / btstack_run_loop.h / bluetooth.h
#include "btstack_run_loop_embedded.h"
#include "hal_time_ms.h"             // hal_time_ms() — implemented below
#include "hal_cpu.h"                 // hal_cpu_* — implemented below
#include "hci_transport.h"

// The HID-over-GATT half of this port (GATT/SM/advertising setup, HID event
// handling, send_keyboard_report) is the shared ports/common/BleHidGatt.swift
// — this file keeps only the CPU2/IPCC transport bring-up. The Swift setup
// ends with hci_power_control(HCI_POWER_ON), so it must run last in
// init_ble_hid() below.
//
// Why the transport itself deliberately stays C (the documented
// mirror-fallback case, unlike the nRF52840 port whose transport is now
// Swift — ports/nrf52840/BleHidSdc.swift): nearly every function below
// reads or writes fields of the VENDORED transport layer's types —
// TL_EvtPacket_t/TL_AclDataPacket_t payload unions, tListNode intrusive
// links, TL_BLE_InitConf_t/TL_MM_Config_t/SHCI_TL_HciInitConf_t configs,
// and the 30-field SHCI_C2_Ble_Init_Cmd_Packet_t. Mirroring those in Swift
// would (a) hand-replicate layouts of structs that ST revises between
// CubeWB releases, and (b) silently break this project's vendoring policy
// that a CubeWB re-sync is a straight file copy — the C compiler checks
// this file's designated initializers against the refreshed headers at
// every build, which a Swift mirror can't. The SRAM2A PLACE_IN_SECTION
// mailbox buffers additionally need exact section attributes matched to
// the linker script. The genuinely ST-independent register work that used
// to live here (LSE/RF-wakeup clock, IPCC reset) is Swift
// (ClockInit.swift/HwIpcc.swift).
extern void smk_ble_hid_gatt_setup(void);

// --- CMSIS device (RCC/PWR/SysTick register definitions) -------------------
#include "stm32wbxx.h"

// --- Task 6's vendored IPCC mailbox transport layer ------------------------
#include "stm32_wpan_common.h"       // PLACE_IN_SECTION / ALIGN / DIVC
#include "stm_list.h"                // LST_* — IRQ-safe intrusive list, used as the event FIFO
#include "tl.h"                      // TL_Init/TL_Enable/TL_BLE_*/TL_MM_* + packet types
#include "shci_tl.h"                 // shci_init(), tSHCI_UserEvtRxParam, shci_user_evt_proc()
#include "shci.h"                    // SHCI_C2_BLE_Init(), SHCI_EVTCODE, SHCI_SUB_EVT_CODE_READY

