mburger89/SMK/ports/stm32wb/platform/ble_hid_wb.c
// ===========================================================================
// CPU2 / BLE stack configuration
// ===========================================================================
// Values taken from ST's own app_conf.h for this exact board
// (~/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate/
// Core/Inc/app_conf.h), except where noted. Reproduced here rather than
// vendoring app_conf.h, which is a ~450-line CubeMX-generated file whose
// other 90% (LPM, sequencer, trace, RTC/hw-timer-server, ST-host-stack
// feature switches) this project deliberately does not have.

#define SMK_BLE_NUM_LINK                 1      /* ST default is 2; this keyboard is a
                                                   single-connection peripheral, and
                                                   btstack_config.h's
                                                   MAX_NR_HCI_CONNECTIONS is 1 to match. */
#define SMK_BLE_NUM_GATT_ATTRIBUTES      0      /* ignored by CPU2 in LL_ONLY mode */
#define SMK_BLE_NUM_GATT_SERVICES        0      /* ignored by CPU2 in LL_ONLY mode */
#define SMK_BLE_ATT_VALUE_ARRAY_SIZE     0      /* ignored by CPU2 in LL_ONLY mode */
#define SMK_BLE_MAX_ATT_MTU              156    /* ignored in LL_ONLY; ST's default kept */
#define SMK_BLE_DATA_LENGTH_EXTENSION    1
#define SMK_BLE_PREPARE_WRITE_LIST_SIZE  0x3A   /* ignored in LL_ONLY; BTstack's WB55 port value */
#define SMK_BLE_MBLOCK_COUNT             0x79   /* overwritten by CPU2 in LL_ONLY; ditto */
#define SMK_BLE_PERIPHERAL_SCA           500
#define SMK_BLE_CENTRAL_SCA              0
#define SMK_BLE_MAX_CONN_EVENT_LENGTH    0xFFFFFFFF
#define SMK_BLE_HSE_STARTUP_TIME         0x148
#define SMK_BLE_VITERBI_MODE             1
#define SMK_BLE_MAX_COC_INITIATOR_NBR    32
#define SMK_BLE_MIN_TX_POWER             (-40)
#define SMK_BLE_MAX_TX_POWER             (6)
#define SMK_BLE_MAX_ADV_SET_NBR          3      /* only used when OPTIONS_EXT_ADV is set */
#define SMK_BLE_MAX_ADV_DATA_LEN         1650   /* likewise */
#define SMK_BLE_TX_PATH_COMPENS          0
#define SMK_BLE_RX_PATH_COMPENS          0
#define SMK_BLE_MAX_ADD_EATT_BEARERS     4

// LsSource bit field, shci.h:706-711. NOCALIB | OTHER_DEV (this is a plain
// WB55 SoC, not a WB5M module) | CLK_LSE — matches ST's own non-STM32WB5Mxx
// branch. ClockInit.swift's smk_enable_lse_and_rf_wakeup_clock() (called
// from init_ble_hid below) actually starts that LSE.
#define SMK_BLE_LS_SOURCE  (SHCI_C2_BLE_INIT_CFG_BLE_LS_NOCALIB   \
                          | SHCI_C2_BLE_INIT_CFG_BLE_LS_OTHER_DEV \
                          | SHCI_C2_BLE_INIT_CFG_BLE_LS_CLK_LSE)

// THE key divergence from ST's own BLE examples: LL_ONLY. ST's app_conf.h
// defaults to SHCI_C2_BLE_INIT_OPTIONS_LL_HOST, i.e. CPU2 runs both the
// link layer *and* ST's BLE host (GAP/GATT/SM) and the application drives it
// over ACI. Here BTstack is the host, so CPU2 must expose a plain HCI
// controller and nothing above it — exactly what
// SHCI_C2_BLE_INIT_OPTIONS_LL_ONLY (shci.h:655) selects, and what BTstack's
// own WB55 port passes (CFG_BLE_LL_ONLY = 1, its app_conf.h:131).
// NOTE: this also means the "HCI only"/"LL only" CPU2 firmware binary
// (stm32wb5x_BLE_HCILayer_fw.bin) is the one that must be flashed to CPU2 —
// the full-stack binary would reject it. Not verifiable in this build-only
// pass; called out for hardware bring-up.
#define SMK_BLE_OPTIONS    (SHCI_C2_BLE_INIT_OPTIONS_LL_ONLY               \
                          | SHCI_C2_BLE_INIT_OPTIONS_WITH_SVC_CHANGE_DESC  \
                          | SHCI_C2_BLE_INIT_OPTIONS_DEVICE_NAME_RW        \
                          | SHCI_C2_BLE_INIT_OPTIONS_NO_EXT_ADV            \
                          | SHCI_C2_BLE_INIT_OPTIONS_NO_CS_ALGO2           \
                          | SHCI_C2_BLE_INIT_OPTIONS_FULL_GATTDB_NVM       \
                          | SHCI_C2_BLE_INIT_OPTIONS_GATT_CACHING_NOTUSED  \
                          | SHCI_C2_BLE_INIT_OPTIONS_POWER_CLASS_2_3)
#define SMK_BLE_OPTIONS_EXT  0

// ===========================================================================
// Mailbox buffers (SRAM2A)
// ===========================================================================
// CPU2 can only address SRAM2A/SRAM2B, so every buffer whose address is
// handed to the mailbox has to live there. PLACE_IN_SECTION's expansion is
// __attribute__((section(name))) with the name used verbatim, no leading dot
// (stm32_wpan_common.h:138) — the linker script's MB_MEM1/MB_MEM2 output
// sections (ports/stm32wb/linker/STM32WB55RGVx_FLASH.ld:192-208) match those
// exact names and place them in MAILBOX_RAM at 0x20030000.
//
// Sizes and section assignment are copied from BTstack's WB55 port
// (port/btstack_port.c:200-209), which in turn matches ST's own
// app_conf.h/app_entry.c pairing. Queue length and payload size are ST's
// defaults (CFG_TLBLE_EVT_QUEUE_LENGTH 5, CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE
// 255 — app_conf.h:409/419).
#define SMK_TLBLE_EVT_QUEUE_LENGTH        5
#define SMK_TLBLE_MOST_EVENT_PAYLOAD_SIZE 255
#define SMK_TL_BLE_EVENT_FRAME_SIZE       (TL_EVT_HDR_SIZE + SMK_TLBLE_MOST_EVENT_PAYLOAD_SIZE)
#define SMK_EVT_POOL_SIZE                                            \
    (SMK_TLBLE_EVT_QUEUE_LENGTH * 4 *                                \
     DIVC((sizeof(TL_PacketHeader_t) + SMK_TL_BLE_EVENT_FRAME_SIZE), 4))

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        EvtPool[SMK_EVT_POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        BleSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        HciAclDataBuffer[sizeof(TL_PacketHeader_t) + 5 + 251];

