mburger89/SMK/ports/stm32wb/platform/ble_hid_wb.c
// ===========================================================================
// BTstack HAL (hal_time_ms.h / hal_cpu.h)
// ===========================================================================
// btstack_config.h sets HAVE_EMBEDDED_TIME_MS, so btstack_run_loop_embedded.c
// calls hal_time_ms() for "now" and for every timer deadline.
//
// Unlike ports/nrf52840/platform/ble_hid_sdc.c (which has no usable timer at
// all yet and fakes this with a per-call counter), this port CAN provide a
// real millisecond clock cheaply: SYSCLK is already fully configured by
// ports/stm32wb/ClockInit.swift (HSE 32MHz direct, no PLL) before
// app_main_swift() runs, so a plain Cortex-M SysTick at SYSCLK/1000 is a
// genuine 1ms tick. SystemCoreClockUpdate() (cmsis-device-wb's
// Source/Templates/system_stm32wbxx.c) recomputes SystemCoreClock from the
// live RCC registers, so this does not hardcode an assumption about what
// ClockInit.swift chose.
//
// This matters more than it might look: BTstack's HCI init state machine
// uses real timeouts (btstack_config.h's HCI_RESET_RESEND_TIMEOUT_MS), and a
// fake counter makes those elapse in "N loop iterations" instead of "N ms".
static volatile uint32_t s_systick_ms = 0;

void SysTick_Handler(void) {
    s_systick_ms++;
}

uint32_t hal_time_ms(void) {
    return s_systick_ms;
}

void hal_cpu_disable_irqs(void) {
    __disable_irq();
}

void hal_cpu_enable_irqs(void) {
    __enable_irq();
}

void hal_cpu_enable_irqs_and_sleep(void) {
    // Deliberately no WFE/WFI, same call as ble_hid_sdc.c made: this
    // project's main loop is cooperative busy-polling throughout
    // (platform_glue.c's vTaskDelay is a nop-loop, not a real sleep), and
    // with no hardware in hand there is nothing to confirm a real sleep
    // wakes back up correctly. Costs power, cannot hang.
    __enable_irq();
}

// ===========================================================================
// Step 1: clocks CPU2 needs, then the CPU2 boot sequence
// ===========================================================================

// The radio's low-speed/wakeup clock. ClockInit.swift (Task 2) brings up
// HSE/HSI48/CRS but deliberately never touches the backup domain — nothing
// before this task needed LSE. CPU2's link layer does: SMK_BLE_LS_SOURCE
// above tells it CLK_LSE, and RCC_CSR's RFWKPSEL field selects which clock
// actually feeds the RF wakeup logic. Implemented in Swift alongside the
// rest of this port's clock bring-up — see ClockInit.swift's
// smk_enable_lse_and_rf_wakeup_clock() for the register-level details.
extern void smk_enable_lse_and_rf_wakeup_clock(void);

// "ipcc_reset" per BTstack's WB55 port (btstack_port.c:260-294), run before
// TL_Init() so leftover channel flags from a CPU1-only reset can't present
// as phantom traffic. Implemented in Swift alongside the rest of the IPCC
// hardware layer — see HwIpcc.swift's smk_ipcc_reset().
extern void smk_ipcc_reset(void);

typedef enum {
    CPU2_STATE_RESET,
    CPU2_STATE_WAIT_FOR_STARTED,
    CPU2_STATE_W2_INIT_BLE,
    CPU2_STATE_READY,
} cpu2_state_t;

static volatile cpu2_state_t cpu2_state = CPU2_STATE_RESET;

// Sends SHCI_OPCODE_C2_BLE_INIT, i.e. "start the BLE stack on CPU2 with this
// configuration". shci.h:1192 declares
//   SHCI_CmdStatus_t SHCI_C2_BLE_Init(SHCI_C2_Ble_Init_Cmd_Packet_t *pCmdPacket);
// and shci.c implements it on top of shci_tl.c's shci_send(), which blocks in
// shci_cmd_resp_wait() until CPU2's command response comes back (see the
// "command response wait" note further down).
//
// Field order below follows the vendored shci.h:382-643
// SHCI_C2_Ble_Init_Cmd_Param_t declaration, cross-checked one-for-one
// against ST's own initializer at
// BLE_HeartRate/STM32_WPAN/App/app_ble.c:264-297. The struct's last two
// fields (extra_data_buffer/extra_data_buffer_size) are zeroed; ST's own
// initializer omits them entirely and relies on partial-initializer
// zero-filling, but spelling them out silences -Wmissing-field-initializers
// and, more usefully, makes a future CubeWB that grows the struct again fail
// loudly here instead of silently.
static void ble_init_and_start(void) {
    SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet = {
        { { 0, 0, 0 } },                    /* Header — unused, filled in by shci.c */
        {
            0,                              /* pBleBufferAddress: NOT USED, shall be 0 */
            0,                              /* BleBufferSize:     NOT USED, shall be 0 */
            SMK_BLE_NUM_GATT_ATTRIBUTES,
            SMK_BLE_NUM_GATT_SERVICES,
            SMK_BLE_ATT_VALUE_ARRAY_SIZE,
            SMK_BLE_NUM_LINK,
            SMK_BLE_DATA_LENGTH_EXTENSION,
            SMK_BLE_PREPARE_WRITE_LIST_SIZE,
            SMK_BLE_MBLOCK_COUNT,
            SMK_BLE_MAX_ATT_MTU,
            SMK_BLE_PERIPHERAL_SCA,
            SMK_BLE_CENTRAL_SCA,
            SMK_BLE_LS_SOURCE,
            SMK_BLE_MAX_CONN_EVENT_LENGTH,
            SMK_BLE_HSE_STARTUP_TIME,
            SMK_BLE_VITERBI_MODE,
            SMK_BLE_OPTIONS,
            0,                              /* HwVersion — filled in by CPU2 */
            SMK_BLE_MAX_COC_INITIATOR_NBR,
            SMK_BLE_MIN_TX_POWER,
            SMK_BLE_MAX_TX_POWER,
            SHCI_C2_BLE_INIT_RX_MODEL_AGC_RSSI_LEGACY,
            SMK_BLE_MAX_ADV_SET_NBR,
            SMK_BLE_MAX_ADV_DATA_LEN,
            SMK_BLE_TX_PATH_COMPENS,
            SMK_BLE_RX_PATH_COMPENS,
            SHCI_C2_BLE_INIT_BLE_CORE_5_4,
            SMK_BLE_OPTIONS_EXT,
            SMK_BLE_MAX_ADD_EATT_BEARERS,
            NULL,                           /* extra_data_buffer: only needed by host
                                               commands this LL_ONLY build never issues */
            0,                              /* extra_data_buffer_size */
        }
    };

    (void)SHCI_C2_BLE_Init(&ble_init_cmd_packet);
}

// ===========================================================================
// Step 2: hci_transport_t bridge
// ===========================================================================

