mburger89/SMK/ports/stm32wb/platform/ble_hid_wb.c
static void (*transport_packet_handler)(uint8_t packet_type, uint8_t *packet, uint16_t size);
static btstack_data_source_t transport_data_source;
// volatile: set from IPCC TX interrupt context (ble_acl_acknowledged), read
// from the run loop (transport_can_send_packet_now).
static volatile int hci_acl_can_send_now;

// Received-but-not-yet-delivered HCI event/ACL packets. BTstack's WB55 port
// uses a FreeRTOS queue here; this project has no RTOS, so the packets are
// chained through their own TL_PacketHeader_t (next/prev — tl.h:65-69, the
// first member of every TL_EvtPacket_t) using ST's stm_list.c. Every LST_*
// entry point brackets its body with __disable_irq()/__set_PRIMASK
// (stm_list.c:56-113), which is exactly the IRQ-vs-main-loop mutual
// exclusion needed here — ST's own hci_tl.c uses these lists for the same
// purpose from the same two contexts.
static tListNode hci_evt_queue;

// --- callbacks handed to the vendored transport layer ---

// TL_SYS_InitConf_t.IoBusCallBackUserEvt path: shci_tl.c's TlUserEvtReceived
// queues the packet and calls shci_notify_asynch_evt(); shci_user_evt_proc()
// then dequeues it and calls the UserEvtRx callback registered by
// shci_init(). The argument is a `tSHCI_UserEvtRxParam *` (shci_tl.c:102-104,
// shci_tl.h:70-74), NOT a bare packet — writing back .status is how the
// application can ask for the event to be re-queued; leaving it at
// SHCI_TL_UserEventFlow_Enable (as set by shci_user_evt_proc before the call)
// means "done, release the buffer".
static void sys_evt_received(void *pdata) {
    if (pdata == NULL) return;

    tSHCI_UserEvtRxParam *user_event = (tSHCI_UserEvtRxParam *)pdata;
    TL_EvtPacket_t *evt_packet = user_event->pckt;
    if (evt_packet == NULL) return;

    TL_EvtSerial_t *shci_evt = &evt_packet->evtserial;

    // shci.h:57 SHCI_EVTCODE == 0xFF (vendor-specific event code); the
    // sub-event code is the first 16-bit LE field of the payload, and
    // SHCI_SUB_EVT_CODE_READY (shci.h:65) is CPU2's "wireless firmware is
    // up" announcement. This is the real wait mechanism the brief asked to
    // be traced rather than guessed: there is no polling API — CPU2 pushes
    // this asynchronous system event up the system channel after
    // TL_Enable() releases it from reset.
    if (shci_evt->evt.evtcode == SHCI_EVTCODE) {
        if (little_endian_read_16(shci_evt->evt.payload, 0) == SHCI_SUB_EVT_CODE_READY) {
            if (cpu2_state == CPU2_STATE_WAIT_FOR_STARTED) {
                cpu2_state = CPU2_STATE_W2_INIT_BLE;
                btstack_run_loop_poll_data_sources_from_irq();
            }
        }
    }
}

// TL_BLE_InitConf_t.IoBusEvtCallBack — called from tl_mbox.c in IPCC RX
// interrupt context with a complete HCI event (or ACL packet) sitting in a
// mailbox buffer that stays ours until TL_MM_EvtDone() releases it.
static void ble_evt_received(TL_EvtPacket_t *hcievt) {
    LST_insert_tail(&hci_evt_queue, (tListNode *)hcievt);
    btstack_run_loop_poll_data_sources_from_irq();
}

// TL_BLE_InitConf_t.IoBusAclDataTxAck — CPU2 has consumed the ACL buffer.
static void ble_acl_acknowledged(void) {
    hci_acl_can_send_now = 1;
    btstack_run_loop_poll_data_sources_from_irq();
}

// --- main-context delivery -------------------------------------------------

static void transport_send_hardware_error(uint8_t error_code) {
    uint8_t event[] = { HCI_EVENT_HARDWARE_ERROR, 1, error_code };
    transport_packet_handler(HCI_EVENT_PACKET, &event[0], sizeof(event));
}

static void transport_notify_packet_send(void) {
    uint8_t event[] = { HCI_EVENT_TRANSPORT_PACKET_SENT, 0 };
    transport_packet_handler(HCI_EVENT_PACKET, &event[0], sizeof(event));
}

static void transport_notify_ready(void) {
    uint8_t event[] = { HCI_EVENT_TRANSPORT_READY, 0 };
    transport_packet_handler(HCI_EVENT_PACKET, &event[0], sizeof(event));
}

static void transport_deliver_hci_packets(void) {
    while (LST_is_empty(&hci_evt_queue) == FALSE) {
        TL_EvtPacket_t *hcievt;
        LST_remove_head(&hci_evt_queue, (tListNode **)&hcievt);

        switch (hcievt->evtserial.type) {
            case HCI_EVENT_PACKET:  // == TL_BLEEVT_PKT_TYPE (0x04)
                // evtserial.evt is {evtcode, plen, payload...}; BTstack wants
                // the event starting at evtcode, length = plen + 2 header bytes.
                transport_packet_handler(hcievt->evtserial.type,
                                         (uint8_t *)&hcievt->evtserial.evt,
                                         hcievt->evtserial.evt.plen + 2);
                break;

            case HCI_ACL_DATA_PACKET: {  // == TL_ACL_DATA_PKT_TYPE (0x02)
                TL_AclDataSerial_t *acl = &(((TL_AclDataPacket_t *)hcievt)->AclDataSerial);
                // Skip the 1-byte packet-type prefix; length = 4-byte ACL
                // header (handle + length) + payload.
                transport_packet_handler(acl->type, &((uint8_t *)acl)[1], acl->length + 4);
                break;
            }

            default:
                transport_send_hardware_error(0x01);
                break;
        }

        TL_MM_EvtDone(hcievt);  // hand the mailbox buffer back to CPU2's memory manager
    }
}

static void transport_process(btstack_data_source_t *ds, btstack_data_source_callback_type_t callback_type) {
    (void)ds;
    if (callback_type != DATA_SOURCE_CALLBACK_POLL) return;

    // Drains the system channel; may re-enter sys_evt_received() above.
    shci_user_evt_proc();

    if (cpu2_state == CPU2_STATE_W2_INIT_BLE) {
        cpu2_state = CPU2_STATE_READY;
        ble_init_and_start();
        transport_notify_ready();
    }

    transport_deliver_hci_packets();
}

// --- hci_transport_t -------------------------------------------------------
// Called by BTstack's hci.c when hci_power_control(HCI_POWER_ON) transitions
// the stack to INITIALIZING. Everything CPU2-related happens here, so CPU2
// is not released from reset until BTstack is actually ready to talk to it.
static void transport_init(const void *transport_config) {
    (void)transport_config;

    btstack_run_loop_set_data_source_handler(&transport_data_source, &transport_process);
    btstack_run_loop_enable_data_source_callbacks(&transport_data_source, DATA_SOURCE_CALLBACK_POLL);
    btstack_run_loop_add_data_source(&transport_data_source);

    LST_init_head(&hci_evt_queue);
    hci_acl_can_send_now = 1;
    cpu2_state = CPU2_STATE_WAIT_FOR_STARTED;

