mburger89/SMK/ports/stm32wb/platform/ble_hid_wb.c
    smk_ipcc_reset();

    // --- the CPU2 boot sequence proper, in the order tl.h/shci_tl.h document ---

    // 1. TL_Init() (tl.h:286) fills in TL_RefTable — the mailbox reference
    //    table CPU2 finds at the fixed SRAM2A base (IPCCDBA option byte) —
    //    and calls HW_IPCC_Init() (HwIpcc.swift) to clock IPCC and enable
    //    both NVIC lines. CPU2 is still in reset at this point.
    TL_Init();

    // 2. shci_init() (shci_tl.h:167) registers the system channel: our
    //    UserEvtRx callback plus the command buffer CPU2 will write
    //    responses into. Internally shci_register_io_bus() points the io
    //    ops at TL_SYS_Init/TL_SYS_SendCmd (shci_tl_if.c) and TlInit() calls
    //    TL_SYS_Init(), which arms the system receive channel.
    //    StatusNotCallBack is optional (shci_tl.c:200-213 null-checks it).
    {
        SHCI_TL_HciInitConf_t shci_init_config;
        shci_init_config.p_cmdbuffer = (uint8_t *)&SystemCmdBuffer;
        shci_init_config.StatusNotCallBack = NULL;
        shci_init(sys_evt_received, (void *)&shci_init_config);
    }

    // 3. TL_MM_Init() (tl.h:338) publishes the spare-event buffers and the
    //    asynchronous-event pool CPU2 allocates its event packets from.
    //    Must happen before CPU2 starts, or it has nowhere to put events.
    {
        // Zero-initialized, deliberately: TL_MM_Config_t (tl.h:174-182) has
        // six fields, and TL_MM_Init() copies ALL of them into the shared
        // mailbox reference table that CPU2 reads. The two this port has no
        // use for (p_TracesEvtPool/TracesEvtPoolSize, for ST's trace
        // channel, which is never enabled here) would otherwise be published
        // to the other processor as uninitialized stack garbage — including
        // a garbage pointer.
        TL_MM_Config_t tl_mm_config = {0};
        tl_mm_config.p_BleSpareEvtBuffer = BleSpareEvtBuffer;
        tl_mm_config.p_SystemSpareEvtBuffer = SystemSpareEvtBuffer;
        tl_mm_config.p_AsynchEvtPool = EvtPool;
        tl_mm_config.AsynchEvtPoolSize = SMK_EVT_POOL_SIZE;
        TL_MM_Init(&tl_mm_config);
    }

    // 4. TL_Enable() (tl.h:285, tl_mbox.c:84-89) is a one-line wrapper around
    //    HW_IPCC_Enable(), which is where CPU2 actually comes out of reset:
    //    HwIpcc.swift's HW_IPCC_Enable() sets PWR_CR4's C2BOOT bit after
    //    arming the EXTI-line-41 wakeup path. This is the
    //    "HAL_PWREx_ReleaseCore-equivalent" the brief asked for — it already
    //    exists in Task 6's code, so there is nothing to duplicate here.
    //    From here on, CPU2 will eventually push SHCI_SUB_EVT_CODE_READY up
    //    the system channel; sys_evt_received() above catches it and
    //    transport_process() then sends SHCI_C2_BLE_Init.
    TL_Enable();

    // 5. BLE channel. Registers the command/ACL buffers and both RX
    //    callbacks, and arms the BLE receive channel (TL_BLE_Init ->
    //    HW_IPCC_BLE_Init). BTstack's WB55 port does this here, before the
    //    ready event, rather than after it (ST's own examples do it after);
    //    TL_BLE_Init only touches CPU1-side state and the IPCC mask, so
    //    either order is safe, and this follows the reference that was
    //    actually validated against BTstack.
    {
        TL_BLE_InitConf_t tl_ble_config;
        tl_ble_config.p_cmdbuffer = (uint8_t *)&BleCmdBuffer;
        tl_ble_config.p_AclDataBuffer = HciAclDataBuffer;
        tl_ble_config.IoBusEvtCallBack = ble_evt_received;
        tl_ble_config.IoBusAclDataTxAck = ble_acl_acknowledged;
        TL_BLE_Init((void *)&tl_ble_config);
    }
}

static int transport_open(void)  { return 0; }
static int transport_close(void) { return 0; }

static void transport_register_packet_handler(void (*handler)(uint8_t packet_type, uint8_t *packet, uint16_t size)) {
    transport_packet_handler = handler;
}

// Unlike ble_hid_sdc.c (whose transport is synchronous and therefore leaves
// this NULL — see its Critical #4 note), this transport really is
// asynchronous and must gate on CPU2 readiness and on ACL buffer ownership,
// so can_send_packet_now is provided AND every send is paired with an
// HCI_EVENT_TRANSPORT_PACKET_SENT via transport_notify_packet_send(). Those
// two go together: hci.c treats a non-NULL can_send_packet_now as "async
// transport, wait for the sent event before reusing the buffer".
static int transport_can_send_packet_now(uint8_t packet_type) {
    if (cpu2_state != CPU2_STATE_READY) return 0;
    switch (packet_type) {
        case HCI_COMMAND_DATA_PACKET: return 1;
        case HCI_ACL_DATA_PACKET:     return hci_acl_can_send_now;
        default:                      return 1;
    }
}

// TL_BLE_SendCmd/TL_BLE_SendAclData (tl.h:292-293) take (buffer, size), but
// tl_mbox.c ignores both arguments entirely: the payload must already be in
// the buffer registered via TL_BLE_InitConf_t, and the call just raises the
// IPCC flag for that channel. Passing (NULL, 0) is the documented usage and
// is what both ST's hci_tl.c (SendCmd: `hciContext.io.Send(0,0)`) and
// BTstack's WB55 port do.
static int transport_send_packet(uint8_t packet_type, uint8_t *packet, int size) {
    switch (packet_type) {
        case HCI_COMMAND_DATA_PACKET:
            // BTstack's HCI command packet is {opcode_lo, opcode_hi, plen,
            // params...} and TL_Cmd_t is {cmdcode:u16, plen:u8,
            // payload[255]} — identical layout, so a single memcpy at &cmd
            // fills cmdcode/plen/payload correctly. (BTstack's own WB55 port
            // additionally assigns cmd.plen = size just before this memcpy;
            // that store is dead, the memcpy overwrites it with the real
            // parameter length one byte in. Dropped rather than copied.)
            BleCmdBuffer.cmdserial.type = packet_type;
            memcpy((void *)&BleCmdBuffer.cmdserial.cmd, packet, size);
            TL_BLE_SendCmd(NULL, 0);
            transport_notify_packet_send();
            break;

        case HCI_ACL_DATA_PACKET:
            hci_acl_can_send_now = 0;
            ((TL_AclDataPacket_t *)HciAclDataBuffer)->AclDataSerial.type = packet_type;
            memcpy((void *)&(((TL_AclDataPacket_t *)HciAclDataBuffer)->AclDataSerial.handle), packet, size);
            TL_BLE_SendAclData(NULL, 0);
            transport_notify_packet_send();
            break;

        default:
            transport_send_hardware_error(0x01);
            return -1;
    }
    return 0;
}

// Field order verified against btstack/src/hci_transport.h.
static const hci_transport_t transport = {
    "stm32wb-ipcc",
    &transport_init,
    &transport_open,
    &transport_close,
    &transport_register_packet_handler,
    &transport_can_send_packet_now,
    &transport_send_packet,
    NULL, // set_baudrate
    NULL, // reset_link
    NULL, // set_sco_config
};

