mburger89/SMK/ports/stm32wb/platform/ble_hid_wb.c
// ===========================================================================
// Command-response wait
// ===========================================================================
// shci_tl.c's shci_send() blocks in shci_cmd_resp_wait() until CPU2 answers,
// and both shci_cmd_resp_wait()/shci_cmd_resp_release() are __WEAK
// (shci_tl.c:236-252) so an application can replace the default spin with an
// RTOS primitive. BTstack's WB55 port replaces both with empty no-ops,
// relying on FreeRTOS scheduling; that is NOT safe here (an empty wait means
// shci_send() memcpy's the response buffer before CPU2 has written it), so
// this file deliberately does NOT override them. ST's default polling
// implementation is the correct one for a bare-metal build: it spins on a
// volatile flag that the IPCC TX interrupt path sets
// (HW_IPCC_Tx_Handler -> HW_IPCC_SYS_CmdEvtNot -> tl_mbox.c's
// TL_SYS_CmdEvtReceived -> shci_tl.c's TlCmdEvtReceived ->
// shci_cmd_resp_release), and interrupts are enabled throughout, so it
// terminates. The only caller is SHCI_C2_BLE_Init() from
// transport_process(), i.e. main context, never an ISR.

// shci_tl.c:127/142/230 call this to say "an SHCI event is queued, please
// call shci_user_evt_proc() soon". Signature from shci_tl.h:108:
// `void shci_notify_asynch_evt(void* pdata)`. transport_process()'s POLL
// callback already calls shci_user_evt_proc() every tick, so all this has
// to do is make sure the run loop gets a chance to run promptly; the
// argument (always &SHciAsynchEventQueue) is not needed.
void shci_notify_asynch_evt(void *pdata) {
    (void)pdata;
    btstack_run_loop_poll_data_sources_from_irq();
}

// ===========================================================================
// Step 3: HID-over-GATT — shared ports/common/BleHidGatt.swift
// ===========================================================================

void init_ble_hid(void) {
    // Clocks CPU2's radio needs, before anything can release CPU2.
    smk_enable_lse_and_rf_wakeup_clock();

    // Real 1ms time base for BTstack's run loop / HCI timeouts. Placed here
    // rather than in ClockInit.swift because nothing before BLE needed it
    // (the scan loop's pacing is platform_glue.c's calibration-free busy
    // loop).
    SystemCoreClockUpdate();
    SysTick_Config(SystemCoreClock / 1000U);

    // BTstack's memory pools are all NULL until this runs — same Critical #3
    // finding documented in ble_hid_sdc.c.
    btstack_memory_init();

    // Must precede hci_init(): hci.c registers timers and data sources
    // against whatever run loop is installed. Pumped once per scan tick from
    // platform_glue.c's vTaskDelay via smk_ble_poll() below.
    btstack_run_loop_init(btstack_run_loop_embedded_get_instance());

    hci_init(&transport, NULL);

    // GATT/SM/advertising setup + hci_power_control(HCI_POWER_ON), shared
    // Swift (ports/common/BleHidGatt.swift). The power-on at its end is
    // what triggers transport_init() above (and therefore the CPU2 boot
    // sequence) as hci.c transitions to INITIALIZING.
    smk_ble_hid_gatt_setup();
}

// Called every scan tick from platform_glue.c's vTaskDelay. One call drives
// the whole BLE side: the embedded run loop's execute_once() fires due
// timers and then polls registered data sources, which is what invokes
// transport_process() above (shci_user_evt_proc, the CPU2-ready transition
// and SHCI_C2_BLE_Init, and HCI packet delivery into BTstack).
void smk_ble_poll(void) {
    btstack_run_loop_embedded_execute_once();
}
